emacs/.emacs.d/init.org
#+TITLE: Jethro's Emacs.d Configuration
* Introduction
* Basic Setup
** Add MELPA and Org Repository
Add package archives. Note that I'm using HTTP, HTTPS did not work for me. To configure HTTPS, simply replace occurrences of http with https.

#+BEGIN_SRC emacs-lisp :tangle yes
(when (>= emacs-major-version 24)
  (require 'package)
  (add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/") t)
  (add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t)
  (package-initialize))
#+END_SRC

** Add [[https://github.com/jwiegley/use-package/issues/70][use-package]]
Use-package allows for isolation of package configuration, while maintaining tidiness and performance.

#+BEGIN_SRC emacs-lisp :tangle yes
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(eval-and-compile
  (defvar use-package-verbose t) 
  (require 'cl)
  (require 'use-package)
  (require 'bind-key)
  (require 'diminish)
  (setq use-package-always-ensure t))
#+END_SRC

** Add validate
Validate is a package that checks for and reports Emacs config errors.
#+begin_src emacs-lisp :tangle yes
  (use-package validate
    :demand t)
#+end_src
** User configuration
#+begin_src emacs-lisp :tangle yes
(setq user-full-name "Jethro Kuan"
      user-mail-address "jethrokuan95@gmail.com")
#+end_src

** Custom file
#+BEGIN_SRC emacs-lisp :tangle yes
  (setq custom-file "~/.emacs.d/custom.el")
  (load custom-file)
#+END_SRC
** Default browser
#+begin_src emacs-lisp :tangle yes
(setq browse-url-browser-function 'browse-url-generic
      browse-url-generic-program "chromium")
#+end_src
** TODO Setup GNUs with Gmail
** Custom font
I use Hack, patched with Powerline. Other good alternatives include Source Code Pro.
*** Source Code Pro
#+BEGIN_SRC emacs-lisp :tangle yes
(add-to-list 'default-frame-alist
             '(font . "Inconsolata-12"))
#+END_SRC

** UI Cruft
Remove useless toolbars and splash screens.

#+begin_src emacs-lisp :tangle yes
(tooltip-mode -1)
(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)
(setq inhibit-splash-screen t)
(setq inhibit-startup-message t)
#+end_src

** Use y/n over yes/no
Always prefer the shorter y/n over yes/no.

#+BEGIN_SRC emacs-lisp :tangle yes
(defalias 'yes-or-no-p 'y-or-n-p)
#+END_SRC

** Replace region when typing
Type over a selected region, instead of deleting before typing.

#+BEGIN_SRC emacs-lisp :tangle yes
(delete-selection-mode +1)
#+end_src

** Sentences
Emacs uses double-spaces by default. Use single spaces by default:

#+BEGIN_QUOTE
NOTE: This will cause an indistinction between sentences and name abbrieviations (eg. E. B. White)
#+END_QUOTE

#+begin_src emacs-lisp :tangle yes
(setq sentence-end-double-space nil)
#+end_src

** Tab with 2 spaces
#+begin_src emacs-lisp :tangle yes
(setq-default tab-width 2)
(setq-default js-indent-level 2)
(setq-default indent-tabs-mode nil)
#+end_src

** Don't wrap lines
Don't wrap lines for coding. Create a hook that enables wrapping, for modes like org-mode and markdown-mode.

#+begin_src emacs-lisp :tangle yes
(setq-default truncate-lines t)
(defun trunc-lines-hook ()
  (setq truncate-lines nil))
#+end_src

** Backup directory
#+begin_src emacs-lisp :tangle yes
(setq backup-directory-alist
      `((".*" . ,temporary-file-directory)))
(setq auto-save-file-name-transforms
      `((".*" ,temporary-file-directory t)))
#+end_src

The following code will delete all backup files that are older than a certain date:

#+begin_src emacs-lisp :tangle yes
(message "Deleting old backup files...")
(let ((week (* 60 60 24 7))
      (current (float-time (current-time))))
  (dolist (file (directory-files temporary-file-directory t))
    (when (and (backup-file-name-p file)
               (> (- current (float-time (fifth (file-attributes file))))
                  week))
      (message "%s" file)
      (delete-file file))))
#+end_src
** Load secrets
#+begin_src emacs-lisp :tangle yes
(load "~/.emacs.d/secrets.el" t)
#+end_src
** Add PATH to eshell
#+begin_src emacs-lisp :tangle yes
(use-package exec-path-from-shell
  :demand t
  :init (exec-path-from-shell-initialize))
#+end_src

** Default shell
#+begin_src emacs-lisp :tangle yes
  (setq-default explicit-shell-file-name "/bin/bash")
  (setq-default shell-file-name "/bin/bash")
#+end_src
** Theme
*** Doom Theme
#+begin_src emacs-lisp :tangle no
  (use-package doom-themes
    :init
    (load-theme 'doom-one t)
    :config
    (add-hook 'find-file-hook 'doom-buffer-mode)
    (add-hook 'minibuffer-setup-hook 'doom-brighten-minibuffer)
    (require 'doom-neotree)
    (setq doom-enable-brighter-comments t)
    (use-package all-the-icons))
#+end_src
*** Theme-less
**** Set background
 #+begin_src emacs-lisp :tangle no
   (add-to-list 'default-frame-alist '(background-color . "ivory"))
   (set-face-attribute 'region nil :background "salmon")
 #+end_src
*** Creamsody Theme
#+begin_src emacs-lisp :tangle yes
  (use-package creamsody-theme
    :init
    (load-theme 'creamsody t)
    :config
    (creamsody-modeline))
#+end_src
** Keybindings
*** Opening Lines
#+begin_src emacs-lisp :tangle yes
  (defun open-next-line (arg)
    "Move to the next line and then opens a line.
     See also `newline-and-indent'."
    (interactive "p")
    (end-of-line)
    (open-line arg)
    (next-line 1)
    (when 'newline-and-indent
      (indent-according-to-mode)))

  (defun open-previous-line (arg)
    "Open a new line before the current one. 
       See also `newline-and-indent'."
    (interactive "p")
    (beginning-of-line)
    (open-line arg)
    (when 'newline-and-indent
      (indent-according-to-mode)))

  (bind-key* "C-o" 'open-next-line)
  (bind-key* "M-o" 'open-previous-line)
#+end_src
*** Nuke all buffers with =C-c !=
#+begin_src emacs-lisp :tangle yes
  (defun jethro/nuke-all-buffers ()
    (interactive)
    (mapcar 'kill-buffer (buffer-list))
    (delete-other-windows))

  (bind-key* "C-c !" 'jethro/nuke-all-buffers)
#+end_src
*** eshell with =C-x m=
#+begin_src emacs-lisp :tangle yes
  (bind-key* "C-x m" 'eshell)
#+end_src
*** mark-paragraph with =M-p=
#+begin_src emacs-lisp :tangle yes
  (bind-key* "M-p" 'mark-paragraph)
#+end_src
*** compile with =<f9>=
#+begin_src emacs-lisp :tangle yes
  (bind-key* "<f9>" (lambda ()
                      (interactive)
                      (setq-local compilation-read-command nil)
                      (call-interactively 'compile)))
#+end_src
**** 
** Hydra
#+begin_src emacs-lisp :tangle yes
  (use-package hydra)
#+end_src
* Ivy
I've recently switched over from =helm= to =ivy=. Ivy is simpler, and easier to extend.
** flx
Flx is required for fuzzy-matching.
#+begin_src emacs-lisp :tangle yes
(use-package flx)
#+end_src
** Counsel
Counsel contains ivy enhancements for commonly-used functions.
#+begin_src emacs-lisp :tangle yes
  (use-package counsel
    :demand t
    :bind*
    (("C-c C-r" . ivy-resume)
     ("M-a" . counsel-M-x)
     ("C-M-i" . counsel-imenu)
     ("C-x C-f" . counsel-find-file)
     ("C-x j" . counsel-dired-jump)
     ("C-c j" . counsel-git-grep)
     ("C-c k" . counsel-ag)
     ("C-c l" . counsel-locate)
     ("M-y" . counsel-yank-pop))
    :bind (:map help-map
                ("f" . counsel-describe-function)
                ("v" . counsel-describe-variable)
                ("l" . counsel-info-lookup-symbol))
    :config
    (ivy-mode 1)
    (setq counsel-find-file-at-point t)
    (setq ivy-use-virtual-buffers t)
    (setq ivy-display-style 'fancy)
    (setq ivy-initial-inputs-alist nil)
    (define-key ivy-minibuffer-map (kbd "<return>") 'ivy-alt-done))
#+end_src
** Swiper
Swiper is ivy-enhanced isearch.
#+begin_src emacs-lisp :tangle yes
  (use-package swiper
    :bind*
    (("C-s" . swiper)
     ("C-r" . swiper)
     ("C-M-s" . swiper-all))
    :bind
    (:map read-expression-map
          ("C-r" . counsel-expression-history)))
#+end_src
** Fuzzy Searching
#+begin_src emacs-lisp :tangle yes
  (setq ivy-re-builders-alist
        '((ivy-switch-buffer . ivy--regex-plus)
          (swiper . ivy--regex-plus)
          (t . ivy--regex-fuzzy)))
#+end_src
** Ivy custom actions
#+begin_src emacs-lisp :tangle yes
  (define-key ivy-minibuffer-map (kbd "C-:") 'ivy-dired)
  (define-key ivy-minibuffer-map (kbd "C-c o") 'ivy-occur)
  (define-key read-expression-map (kbd "C-r") 'counsel-expression-history)
  (ivy-set-actions
   t
   '(("I" insert "insert")))
#+end_src
*** Ivy-dired
#+begin_src emacs-lisp :tangle yes
  (defun ivy-dired ()
    (interactive)
    (if ivy--directory
        (ivy-quit-and-run
         (dired ivy--directory)
         (when (re-search-forward
                (regexp-quote
                 (substring ivy--current 0 -1)) nil t)
           (goto-char (match-beginning 0))))
      (user-error
       "Not completing files currently")))

  (define-key ivy-minibuffer-map (kbd "C-:") 'ivy-dired)
#+end_src 
* Moving Around
** GTD files
#+begin_src emacs-lisp :tangle yes
  (setq jethro/org-files "~/.org/")

  (defun jethro/find-org-file (file-str) 
    (find-file (concat (file-name-directory jethro/org-files) file-str)))

  (defun jethro/find-work-file ()
    (interactive)
    (jethro/find-org-file "work.org"))

  (defun jethro/find-school-file ()
    (interactive)
    (jethro/find-org-file "school.org"))

  (bind-key* "<f1> w" 'jethro/find-work-file)
  (bind-key* "<f1> s" 'jethro/find-school-file)
#+end_src
** neotree
#+begin_src emacs-lisp :tangle yes
  (use-package neotree)
#+end_src
** Crux
#+begin_src emacs-lisp :tangle yes
  (use-package crux
    :commands (crux-switch-to-previous-buffer)
    :bind* (("C-c o" . crux-open-with)
            ("C-c n" . crux-cleanup-buffer-or-region)
            ("C-c D" . crux-delete-file-and-buffer)
            ("C-a" . crux-move-beginning-of-line)
            ("M-o" . crux-smart-open-line)
            ("C-c r" . crux-rename-file-and-buffer)
            ("C-c d" . crux-duplicate-current-line-or-region)
            ("C-c M-d" . crux-duplicate-and-comment-current-line-or-region)
            ("s-o" . crux-smart-open-line-above)))
#+end_src
