emacs/.emacs.d/init.org
** avy
Use avy to move between visible text.
#+begin_src emacs-lisp :tangle yes

  (use-package avy
    :bind* (("C-'" . avy-goto-char)
            ("C-," . avy-goto-char-2))
    :config
    (setq avy-keys '(?h ?t ?n ?s)))
#+end_src
** dumb-jump
Use it to jump to function definitions. Requires no external depedencies.
#+begin_src emacs-lisp :tangle yes
(use-package dumb-jump
  :diminish dumb-jump-mode
  :bind (("C-M-g" . dumb-jump-go)
         ("C-M-p" . dumb-jump-back)
         ("C-M-q" . dumb-jump-quick-look)))
#+end_src
** Window switching
#+begin_src emacs-lisp :tangle yes
  (defun prev-window ()
     (interactive)
     (other-window -1))

  (bind-key* "M-\"" 'prev-window)
  (bind-key* "M-'" 'other-window)
#+end_src
** ace-window (disabled)
Ace-window makes it easier to move between windows.
#+begin_src emacs-lisp :tangle no
  (use-package ace-window
    :bind ("M-'" . ace-window)
    :config
    (setq aw-keys '(?h ?t ?n ?s)))
#+end_src
** dired
*** Hide details
Hide details and only show file and folder names.
#+begin_src emacs-lisp :tangle yes
  (defun jethro/dired-mode-setup-hook ()
    "hook for dired-mode"
    (dired-hide-details-mode 1))

  (add-hook 'dired-mode-hook 'jethro/dired-mode-setup-hook)
#+end_src
*** Sort directories first
#+begin_src emacs-lisp :tangle yes
(setq dired-listing-switches "-aBhl  --group-directories-first")
#+end_src
*** Recursive Copying and Deleting
#+begin_src emacs-lisp :tangle yes
  (setq dired-recursive-copies (quote always))
  (setq dired-recursive-deletes (quote top))
#+end_src
*** dired-jump from file
#+begin_src emacs-lisp :tangle yes
  (require 'dired-x)
#+end_src
** save-place-mode
Save the cursor location for files I've visited.
#+begin_src emacs-lisp :tangle yes
  (save-place-mode 1)
#+end_src
** key-chord
#+begin_src emacs-lisp :tangle yes
  (use-package key-chord
    :config
    (key-chord-mode 1)
    (key-chord-define-global "mw" 'avy-goto-word-1)   
    (key-chord-define-global "jk" 'avy-goto-char)
    (key-chord-define-global "JJ" 'crux-switch-to-previous-buffer)
    (key-chord-define-global "FF" 'counsel-find-file)
    (key-chord-define-global "xx" 'execute-extended-command)
    (key-chord-define-global "yy" 'counsel-yank-pop)
    (key-chord-define-global ",." 'neotree-toggle))
#+end_src
* Editing Text
** visual-regexp
#+begin_src emacs-lisp :tangle yes
  (use-package visual-regexp
    :bind* (("C-M-%" . vr/query-replace)
            ("C-c m" . vr/mc-mark)))
#+end_src
** electric-pair mode
#+begin_src emacs-lisp :tangle yes
  (add-hook 'after-init-hook (lambda () (electric-pair-mode 1)))
#+end_src
** electric-align
Use multiple spaces to align code and text.
#+begin_src emacs-lisp :tangle yes
(use-package electric-align
  :ensure f
  :load-path "elisp/"
  :diminish electric-align-mode
  :config (add-hook 'prog-mode-hook 'electric-align-mode))
#+end_src
** aggressive-indent
Keep your text indented at all times. Remember to turn this off for indentation-dependent languages like Python and Haml.
#+begin_src emacs-lisp :tangle yes
(use-package aggressive-indent
  :diminish aggressive-indent-mode
  :config (add-hook 'prog-mode-hook 'aggressive-indent-mode))
#+end_src
** multiple-cursors
A port of Sublime Text's multiple-cursors functionality.
#+begin_src emacs-lisp :tangle yes
(use-package multiple-cursors
  :bind (("C-M-c" . mc/edit-lines)
         ("C->" . mc/mark-next-like-this)
         ("C-<" . mc/mark-previous-like-this)
         ("C-c C-<" . mc/mark-all-like-this)))
#+end_src
** expand-region
Use this often, and in combination with multiple-cursors.
#+begin_src emacs-lisp :tangle yes
  (use-package expand-region
    :bind (("C-=" . er/expand-region)))
#+end_src
** paredit
For editing Lisp code.
#+begin_src emacs-lisp :tangle no
(use-package paredit
  :diminish paredit-mode
  :config
  (add-hook 'emacs-lisp-mode-hook 'paredit-mode)
  (add-hook 'clojure-mode-hook 'paredit-mode))
#+end_src
** smartparens
#+begin_src emacs-lisp :tangle yes
  (use-package smartparens
    :bind (:map smartparens-mode-map
                ("C-M-a" . sp-beginning-of-sexp)
                ("C-M-e" . sp-end-of-sexp)

                ("C-<down>" . sp-down-sexp)
                ("C-<up>"   . sp-up-sexp)
                ("M-<down>" . sp-backward-down-sexp)
                ("M-<up>"   . sp-backward-up-sexp)

                ("C-M-f" . sp-forward-sexp)
                ("C-M-b" . sp-backward-sexp)

                ("C-M-n" . sp-next-sexp)
                ("C-M-p" . sp-previous-sexp)

                ("C-S-f" . sp-forward-symbol)
                ("C-S-b" . sp-backward-symbol)

                ("C-<right>" . sp-forward-slurp-sexp)
                ("M-<right>" . sp-forward-barf-sexp)
                ("C-<left>"  . sp-backward-slurp-sexp)
                ("M-<left>"  . sp-backward-barf-sexp)

                ("C-M-t" . sp-transpose-sexp)
                ("C-M-k" . sp-kill-sexp)
                ("C-k"   . sp-kill-hybrid-sexp)
                ("M-k"   . sp-backward-kill-sexp)
                ("C-M-w" . sp-copy-sexp)

                ("C-M-d" . delete-sexp)

                ("M-<backspace>" . backward-kill-word)
                ("C-<backspace>" . sp-backward-kill-word)
                ([remap sp-backward-kill-word] . backward-kill-word)

                ("M-[" . sp-backward-unwrap-sexp)
                ("M-]" . sp-unwrap-sexp)

                ("C-x C-t" . sp-transpose-hybrid-sexp)

                ("M-c ("  . wrap-with-parens)
                ("M-c ["  . wrap-with-brackets)
                ("M-c {"  . wrap-with-braces)
                ("M-c '"  . wrap-with-single-quotes)
                ("M-c \"" . wrap-with-double-quotes)
                ("M-c _"  . wrap-with-underscores)
                ("M-c `"  . wrap-with-back-quotes)) 
    :init
    (add-hook 'emacs-lisp-mode-hook 'turn-on-smartparens-strict-mode)
    (add-hook 'clojure-mode-hook 'turn-on-smartparens-strict-mode)
    :config
    (require 'smartparens-config)
    (defmacro def-pairs (pairs)
      `(progn
         ,@(loop for (key . val) in pairs
                 collect
                 `(defun ,(read (concat
                                 "wrap-with-"
                                 (prin1-to-string key)
                                 "s"))
                      (&optional arg)
                    (interactive "p")
                    (sp-wrap-with-pair ,val)))))

    (def-pairs ((paren        . "(")
                (bracket      . "[")
                (brace        . "{")
                (single-quote . "'")
                (double-quote . "\"")
                (back-quote   . "`"))))
#+end_src
** zap-up-to-char
#+begin_src emacs-lisp :tangle yes
  (autoload 'zap-up-to-char "misc"
    "Kill up to, but not including ARGth occurrence of CHAR.

    \(fn arg char)"
    'interactive)

  (bind-key* "M-z" 'zap-up-to-char)
#+end_src
** move-text
#+begin_src emacs-lisp :tangle yes
  (use-package move-text
    :bind (("M-<up>" . move-text-up)
           ("M-<down>" . move-text-down)))
#+end_src
** Linting with Flycheck
#+begin_src emacs-lisp :tangle yes
  (use-package flycheck
    :config
    (global-set-key (kbd "C-c f")
                    (defhydra hydra-flycheck
                      (:pre (progn (setq hydra-lv t) (flycheck-list-errors))
                            :post (progn (setq hydra-lv nil) (quit-windows-on "*Flycheck errors*"))
                            :hint nil)
                      "Errors"
                      ("f"  flycheck-error-list-set-filter                            "Filter")
                      ("n"  flycheck-next-error                                       "Next")
                      ("p"  flycheck-previous-error                                   "Previous")
                      ("<" flycheck-first-error                                      "First")
                      (">"  (progn (goto-char (point-max)) (flycheck-previous-error)) "Last")
                      ("q"  nil)))
    (use-package flycheck-pos-tip
      :config (flycheck-pos-tip-mode))
    (add-hook 'prog-mode-hook 'global-flycheck-mode))
#+end_src
** Templating with Yasnippet
#+begin_src emacs-lisp :tangle yes
  (use-package yasnippet
    :diminish yas-global-mode yas-minor-mode
    :init (add-hook 'after-init-hook 'yas-global-mode)
    :config (setq yas-snippet-dirs '("~/.emacs.d/snippets/")))
#+end_src
** Autocompletions with Company
#+begin_src emacs-lisp :tangle yes
(use-package company
  :diminish company-mode
  :init (progn
          (add-hook 'after-init-hook 'global-company-mode)
          (setq company-dabbrev-ignore-case nil
                company-dabbrev-code-ignore-case nil
                company-dabbrev-downcase nil
                company-idle-delay 0
                company-begin-commands '(self-insert-command)
                company-transformers '(company-sort-by-occurrence))
          (use-package company-quickhelp
            :config (company-quickhelp-mode 1))))
#+end_src
** Spellcheck with Flyspell
#+begin_src emacs-lisp :tangle yes
  (use-package flyspell
    :ensure f
    :diminish flyspell-mode
    :config
    (add-hook 'text-mode-hook 'flyspell-mode)
    (add-hook 'org-mode-hook 'flyspell-mode)
    (add-hook 'markdown-mode-hook 'flyspell-mode))
#+end_src
* Language Support
