emacs/.emacs.d/init.org
** Smart-mode-line
#+begin_src emacs-lisp :tangle yes
  (use-package smart-mode-line
    :config   
    (setq sml/theme 'dark)
    (add-hook 'after-init-hook 'sml/setup)
    (setq sml/name-width 30)
    (setq sml/shorten-directory t)
    (setq sml/shorten-modes t)
    (setq sml/mode-width 'full)
    (setq sml/replacer-regexp-list
          '(("^~/.org/" ":O:")
            ("^~/\\.emacs\\.d/" ":ED")))
    (setq rm-blacklist
          (format "^ \\(%s\\)$"
                  (mapconcat #'identity
                             '("FlyC.*"
                               "Projectile.*"
                               "GitGutter"
                               "ivy"
                               "company"
                               ""
                               "doom"
                               ","
                               "ElDoc")
                             "\\|"))))
#+end_src
*** Showing time
#+begin_src emacs-lisp :tangle yes
(setq display-time-24hr-format t)
(display-time-mode 1)
#+end_src
** nyan-mode
#+begin_src emacs-lisp :tangle no
  (use-package nyan-mode
    :config
    (nyan-mode 1))
#+end_src
** Zooming
#+begin_src emacs-lisp :tangle yes
(defhydra hydra-zoom (global-map "<f2>")
  "zoom"
  ("i" text-scale-increase "in")
  ("o" text-scale-decrease "out"))
#+end_src
** beacon
Beacon makes sure you don't lose track of your cursor when jumping around a buffer.
#+begin_src emacs-lisp :tangle yes
  (use-package beacon
    :diminish beacon-mode
    :config
    (beacon-mode 1)
    (setq beacon-push-mark 10))
#+end_src
** show-paren
Always show matching parenthesis.
#+begin_src emacs-lisp :tangle yes
(show-paren-mode 1)
(setq show-paren-delay 0)
#+end_src
** golden-ratio
Give the working window more screen estate.
#+begin_src emacs-lisp :tangle yes
(use-package golden-ratio
  :diminish golden-ratio-mode
  :config (progn
            (add-to-list 'golden-ratio-extra-commands 'ace-window)
            (golden-ratio-mode 1)))
#+end_src
** volatile-highlights
Highlights recently copied/pasted text.
#+begin_src emacs-lisp :tangle yes
(use-package volatile-highlights
  :diminish volatile-highlights-mode
  :config (volatile-highlights-mode t))
#+end_src
** git-gutter-fringe+
Displays added/modified/deleted on the left.
#+begin_src emacs-lisp :tangle yes
  (use-package git-gutter-fringe+
    :config
    (global-git-gutter+-mode)
    (set-face-foreground 'git-gutter+-modified "gold1")
    (set-face-foreground 'git-gutter+-added    "SeaGreen")
    (set-face-foreground 'git-gutter+-deleted  "IndianRed")
    (setq git-gutter-fr+-side 'left-fringe))
#+end_src
* Org-mode
** Prerequisites
*** Htmlize
We need =htmlize= to add syntax highlighting to org-exports for HTML files.

#+begin_src emacs-lisp :tangle yes
  (use-package htmlize
    :config
    (require 'htmlize))
#+end_src
** Basic Configuration
#+begin_src emacs-lisp :tangle yes
  (use-package org
    :bind (("C-c c" . org-capture)
           ("C-c a" . org-agenda)
           ("C-c l" . org-store-link))
    :mode ("\\.org\\'" . org-mode)
    :init
    (add-hook 'org-mode-hook #'trunc-lines-hook)
    (setq org-ellipsis "…")
    (setq org-directory "~/.org")
    (setq org-default-notes-directory (concat org-directory "/notes.org"))   
    (setq org-hide-emphasis-markers t)
    (setq org-src-tab-acts-natively t)
    (font-lock-add-keywords 'org-mode
                    '(("^ +\\([-*]\\) "
                       (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•")))))) 
    (setq org-refile-targets
                   '((nil :maxlevel . 3)
                     (org-agenda-files :maxlevel . 3)))
    (setq org-use-fast-todo-selection t)
    (setq org-treat-S-cursor-todo-selection-as-state-change nil)
    (setq org-capture-templates
                   '(("b" "Book" entry (file "~/.org/books.org")
                      "* TO-READ %(org-set-tags)%? %i\n"))))
#+end_src
** org-agenda
   #+begin_src emacs-lisp :tangle yes
     (defvar jethro/org-agenda-files
       (append
        (file-expand-wildcards "~/.org/*.org"))
       "Files to include in org-agenda-files")

     (setq org-agenda-files jethro/org-agenda-files)

     (setq org-agenda-custom-commands 
           '(("w" todo "WAITING" nil) 
             ("n" todo "NEXT" nil)
             ("d" "Agenda + Next Actions" ((agenda) (todo "NEXT"))))
           )

     (setq org-agenda-dim-blocked-tasks t)

#+end_src
** org-publish
#+begin_src emacs-lisp :tangle yes
  (defun jethro/auto-git-commit-and-push (dir)
    (shell-command (format "cd %s && git add -A && git commit -m \"%s\" && git push origin master" dir "New changes: $(date)")))

  (setq jethro/emacsd-site-dir "~/Documents/Code/emacsd_site/")
  (setq jethro/books-dir "~/Documents/Code/books/")

  (setq org-publish-project-alist
        '(("books"
           ;; Path to your org files.
           :publishing-function org-html-publish-to-html
           :publishing-directory jethro/books-dir
           :base-directory "~/.org/"
           :completion-function (lambda () 
                                  (shell-command (format "cd %s && ruby books.rb && git add -A && git commit -m \"%s\" && git push origin master" jethro/books-dir "New changes: $(date)")))
           :exclude ".*"
           :include ["books.org"]
           :with-emphasize t
           :with-todo-keywords t
           :with-toc nil
           :html-preamble t)
          ("emacs.d"
           :publishing-function org-html-publish-to-html
           :publishing-directory jethro/emacsd-site-dir
           :base-directory "~/.emacs.d/"
           :exclude ".*"
           :include ["init.org"]
           :completion-function (lambda () (let ((htmlfile (concat jethro/emacsd-site-dir
                                                                   "init.html")))
                                             (if (file-exists-p htmlfile)
                                                 (progn
                                                   (rename-file htmlfile
                                                                (concat jethro/emacsd-site-dir
                                                                        "index.html") t)
                                                   (jethro/auto-git-commit-and-push jethro/emacsd-site-dir)))))
           :with-emphasize t
           :with-title nil
           :with-toc t
           :html-head "<link rel=\"stylesheet\" href=\"/css/emacsd.css\" type=\"text/css\">"
           :html-preamble t)))
#+end_src
** org-reveal
#+begin_src emacs-lisp :tangle yes
  (use-package ox-reveal
    :config
    (require 'ox-reveal))
#+end_src
